# 빅데이터 개론 복습1
> 파이썬 표현식과 변수, pandas 데이터 프레임

- toc: true
- branch: master
- badges: true
- comments: true
- author: 김혜지
- categories: [python]

## 표현식과 변수

In [34]:
hour_rate = 10000
month_working_days = 20
day_working_hours = 4
month_pay = hour_rate * month_working_days * day_working_hours
month_pay

800000

In [35]:
text_2 ='you can\'t come' #역슬래시로 구분하기
text_2

"you can't come"

In [36]:
#\n 이 나타나면 줄을 바꾸는 기능
print("첫 번째 줄 \n두 번째 줄")

첫 번째 줄
두 번째 줄

In [38]:
text_4 = 'C:\some\name'
print(text_4)

C:\some
ame

In [37]:
#앞에 r을 붙이면 줄바꿈 안 됨
text_5 = r'C:\some\name'
print(text_5)

C:\some\name

- 라이브러리와 함수

In [45]:
import math

In [47]:
math.sin(2)

0.9092974268256817

In [49]:
math.log(100)

4.605170185988092

- 리스트

In [51]:
list_1 = [1, 2, 0.5, 'chair']
list_1

[1, 2, 0.5, 'chair']

In [52]:
list_2 = [ list_1, "A", [1,2,3] ]
list_2

[[1, 2, 0.5, 'chair'], 'A', [1, 2, 3]]

**파이썬의 인덱스는 1이 아닌 0 부터 시작하므로 이를 언제나 유념해야 한다**

In [53]:
squares = [1, 4, 9, 16, 25]

In [54]:
squares[0]

1

In [55]:
squares[4]

25

In [58]:
squares[:1]

[1]

In [59]:
squares[:-1]

[1, 4, 9, 16]

In [68]:
squares[-1:]

[25]

In [72]:
#in 연산자
1 in [1, 2, 3, 4]

True

In [73]:
a = 5
a in [1, 2, 3, 4, 5]

True

## 실습

1. hstudent.csv'는 20명의 고등학생 성별, 학년, 키(cm), 몸무게(kg)를 조사한 자료이다.

- 체질량지수는 몸무게(kg)를 키의 제곱(m)으로 나눈 값입니다.
    - 5번 학생의 체질량지수는?
    - 10번 학생의 체질량지수는?
- 학생의 키와 몸무게를 각각 height와 weight에 저장하고, height와 weight를 사용하여 체질량지수 계산
    - 5번 과 10번 학생 각각에 대하여 계산한 후 bmi5와 bmi10에 저장
    - bmi5와 bmi10의 크기 비교 결과 print함수를 사용하여 보여주기
- 1번부터 5번까지의 학생 키를 원소로 가지는 리스트 변수 height1_5생성
    - 1번부터 3번까지 학생의 키 추출
    
2. 나는 전북대학교 학과 이름 입니다. (예, 나는 전북대학교 통계학과 최혜미입니다)
    - 위 문자열을 값으로 가지는 변수 name_dept를 생성
    - 변수 name_dept에서 전북대학교 추출

In [159]:
df = pd.read_csv("hstudent.csv")
df

    gender  grade  height  weight
0        1      3     183      82
1        2      1     168      52
2        2      1     160      48
3        2      2     160      50
4        1      1     160      79
5        1      2     180      73
6        2      2     183      60
7        1      1     170      66
8        1      3     170      74
9        1      3     185      57
10       1      2     165      54
11       2      1     170      50
12       2      1     152      60
13       2      3     173      63
14       1      1     145      57
15       1      3     163      77
16       2      2     178      50
17       2      2     163      57
18       2      2     168      54
19       2      3     170      57

In [163]:
height = df['height']
weight = df['weight']

In [169]:
bmi5 = weight[4]/height[4]**2
bmi10 = weight[9]/height[9]**2
print(bmi5, bmi10)

0.0030859375 0.0016654492330168006

In [180]:
height1_5 = height[0:5]
height1_5[0:3]

0    183
1    168
2    160
Name: height, dtype: int64

In [185]:
height1_5 = list(height[0:5])
height1_5[0:3]

[183, 168, 160]

In [156]:
# height = [183, 168, 160, 160, 160, 180, 183, 170, 170, 185, 165, 170, 152, 173, 145, 163, 178, 163, 168, 170]
# weight = [82, 52, 48, 50, 79, 73, 60, 66, 74, 57, 54, 50, 60, 63, 57, 77, 50, 57, 54, 57]

In [115]:
name_debt = "나는 전북대학교 스페인어학과 김혜지입니다."
name_debt[3:8]

'전북대학교'

## 판다스 데이터 프레임

In [2]:
import pandas as pd

In [65]:
df = pd.DataFrame({
'name' : ['이철수', '김영희', '홍길동', 'John Smith'], 'sex' : ['M', 'F', 'M', 'M'], 'age' : [23, 25, 21, 33]
})

In [66]:
df

         name sex  age
0         이철수   M   23
1         김영희   F   25
2         홍길동   M   21
3  John Smith   M   33

- 슬라이싱

In [10]:
df[['name', 'age']] #두 개 이상의 열을 슬라이싱 하기위해서는 리스트를 사용하기

         name  age
0         이철수   23
1         김영희   25
2         홍길동   21
3  John Smith   33

In [9]:
#데이터 프레임의 하나의 열 == 시리즈
#데이터 프레임 열을 슬라이스 하는 경우는 마침표 사용해서 슬라이싱이 가능
df.age

0    23
1    25
2    21
3    33
Name: age, dtype: int64

In [13]:
df[df['age'] >= 25]
#df['age'] >= 25는 참, 거짓으로 구성된 시리즈 -> 슬라이싱 하기 위해서는 df을 한 번 더 씌어주면 됨

         name sex  age
1         김영희   F   25
3  John Smith   M   33

- 데이터 프레임 메소드

In [14]:
df.describe() #describe() : 숫자로 구성된 열의 기초 통계량을 구하는 표현식

             age
count   4.000000
mean   25.500000
std     5.259911
min    21.000000
25%    22.500000
50%    24.000000
75%    27.000000
max    33.000000

In [67]:
df.max() #각 열의 최대값을 구하는 작업을 수행 ?왜 맥스 값을 찍었는데 홍길동 이름이 나오지? 
#한글은 가나다순, 영어는 알파벳 순으로 max값이 뽑힌다.

name    홍길동
sex       M
age      33
dtype: object

In [18]:
df.shape

(4, 3)

In [21]:
df.iloc[1,0]

'김영희'

In [33]:
df.iloc[2,2]

21